In [2]:
import pandas as pd
import numpy as np
df = pd.read_csv('titanic.csv')

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df[df['Embarked'] == 'C'].groupby('Sex')['Age'].mean()

Sex
female    28.344262
male      32.998841
Name: Age, dtype: float64

In [5]:
df[df['Embarked'] == 'C']['Age'].mean()

30.81476923076923

In [7]:
print((28.344262+ 32.998841)/2)

30.6715515

In [13]:
df[df['Embarked'] == 'C'].groupby('Sex')['Age'].count()

Sex
female    61
male      69
Name: Age, dtype: int64

In [15]:
print(((61*28.344262) + (69*32.998841))/(61+69))

30.814769315384616

In [16]:
counts = df[df['Embarked'] == 'C'].groupby('Sex')['Age'].count()

In [18]:
averages = df[df['Embarked'] == 'C'].groupby('Sex')['Age'].mean()

In [26]:
oa = pd.concat([counts, averages], axis=1)

In [40]:
oa

         0        Age
Sex
female  61  28.344262
male    69  32.998841

In [35]:
oa.rename(index = {0 : 'Count'}, inplace=True)

In [36]:
oa

        Age        Age
Sex
female   61  28.344262
male     69  32.998841

In [37]:
counts.rename(columns={'Age': 'Counts'}, inplace=True)

Sex
female    61
male      69
dtype: int64

In [39]:
oa = pd.concat([counts, averages], axis=1)

In [55]:
oa.rename(columns={0:'Counts'}, errors='raise', inplace=True)

In [56]:
oa

        Counts        Age
Sex
female      61  28.344262
male        69  32.998841